// Copyright (c) 2015 Martin Ridgers
// License: http://opensource.org/licenses/MIT

#include "pch.h"
#include "str_compare.h"

threadlocal int str_compare_scope::ts_mode = str_compare_scope::exact;
threadlocal bool str_compare_scope::ts_fuzzy_accents = false;

//------------------------------------------------------------------------------
str_compare_scope::str_compare_scope(int mode, bool fuzzy_accents)
{
    m_prev_mode = ts_mode;
    m_prev_fuzzy_accents = ts_fuzzy_accents;

    if (mode < str_compare_scope::exact || mode >= str_compare_scope::num_scope_values)
        mode = str_compare_scope::exact;

    ts_mode = mode;
    ts_fuzzy_accents = fuzzy_accents;
}

//------------------------------------------------------------------------------
str_compare_scope::~str_compare_scope()
{
    ts_mode = m_prev_mode;
    ts_fuzzy_accents = m_prev_fuzzy_accents;
}

//------------------------------------------------------------------------------
int str_compare_scope::current()
{
    return ts_mode;
}

//------------------------------------------------------------------------------
bool str_compare_scope::current_fuzzy_accents()
{
    return ts_fuzzy_accents;
}

//------------------------------------------------------------------------------
int normalize_accent(int c)
{
    // Dipthongs are not supported in fuzzy accent matching.
#if 0
    L"Æ", "AE",
    L"Þ", "TH",
    L"æ", "ae",
    L"þ", "th",
    L"Ĳ", "IJ",
    L"ĳ", "ij",
    L"Œ", "OE",
    L"œ", "oe",
    L"Đ", "DJ",
    L"đ", "dj",
#endif

    struct fuzzy_accent
    {
        wchar_t accent;
        wchar_t normal;
    };

    static const fuzzy_accent fuzzy_accent_map[] =
    {
        // 00xx
        { 0x00C0 /* À */, L'A', },
        { 0x00C1 /* Á */, L'A', },
        { 0x00C2 /* Â */, L'A', },
        { 0x00C3 /* Ã */, L'A', },
        { 0x00C4 /* Ä */, L'A', },
        { 0x00C5 /* Å */, L'A', },
        { 0x00C7 /* Ç */, L'C', },
        { 0x00C8 /* È */, L'E', },
        { 0x00C9 /* É */, L'E', },
        { 0x00CA /* Ê */, L'E', },
        { 0x00CB /* Ë */, L'E', },
        { 0x00CC /* Ì */, L'I', },
        { 0x00CD /* Í */, L'I', },
        { 0x00CE /* Î */, L'I', },
        { 0x00CF /* Ï */, L'I', },
        { 0x00D0 /* Ð */, L'D', },
        { 0x00D1 /* Ñ */, L'N', },
        { 0x00D2 /* Ò */, L'O', },
        { 0x00D3 /* Ó */, L'O', },
        { 0x00D4 /* Ô */, L'O', },
        { 0x00D5 /* Õ */, L'O', },
        { 0x00D6 /* Ö */, L'O', },
        { 0x00D8 /* Ø */, L'O', },
        { 0x00D9 /* Ù */, L'U', },
        { 0x00DA /* Ú */, L'U', },
        { 0x00DB /* Û */, L'U', },
        { 0x00DC /* Ü */, L'U', },
        { 0x00DD /* Ý */, L'Y', },
        { 0x00DF /* ß */, L's', },
        { 0x00E0 /* à */, L'a', },
        { 0x00E1 /* á */, L'a', },
        { 0x00E2 /* â */, L'a', },
        { 0x00E3 /* ã */, L'a', },
        { 0x00E4 /* ä */, L'a', },
        { 0x00E5 /* å */, L'a', },
        { 0x00E7 /* ç */, L'c', },
        { 0x00E8 /* è */, L'e', },
        { 0x00E9 /* é */, L'e', },
        { 0x00EA /* ê */, L'e', },
        { 0x00EB /* ë */, L'e', },
        { 0x00EC /* ì */, L'i', },
        { 0x00ED /* í */, L'i', },
        { 0x00EE /* î */, L'i', },
        { 0x00EF /* ï */, L'i', },
        { 0x00F0 /* ð */, L'd', },
        { 0x00F1 /* ñ */, L'n', },
        { 0x00F2 /* ò */, L'o', },
        { 0x00F3 /* ó */, L'o', },
        { 0x00F4 /* ô */, L'o', },
        { 0x00F5 /* õ */, L'o', },
        { 0x00F6 /* ö */, L'o', },
        { 0x00F8 /* ø */, L'o', },
        { 0x00F9 /* ù */, L'u', },
        { 0x00FA /* ú */, L'u', },
        { 0x00FB /* û */, L'u', },
        { 0x00FC /* ü */, L'u', },
        { 0x00FD /* ý */, L'y', },
        { 0x00FF /* ÿ */, L'y', },
        // 01xx
        { 0x0100 /* Ā */, L'A', },
        { 0x0101 /* ā */, L'a', },
        { 0x0102 /* Ă */, L'A', },
        { 0x0103 /* ă */, L'a', },
        { 0x0104 /* Ą */, L'A', },
        { 0x0105 /* ą */, L'a', },
        { 0x0106 /* Ć */, L'C', },
        { 0x0107 /* ć */, L'c', },
        { 0x0108 /* Ĉ */, L'C', },
        { 0x0109 /* ĉ */, L'c', },
        { 0x010A /* Ċ */, L'C', },
        { 0x010B /* ċ */, L'c', },
        { 0x010C /* Č */, L'C', },
        { 0x010D /* č */, L'c', },
        { 0x010E /* Ď */, L'D', },
        { 0x010F /* ď */, L'd', },
        { 0x0110 /* Đ */, L'D', },
        { 0x0111 /* đ */, L'd', },
        { 0x0112 /* Ē */, L'E', },
        { 0x0113 /* ē */, L'e', },
        { 0x0114 /* Ĕ */, L'E', },
        { 0x0115 /* ĕ */, L'e', },
        { 0x0116 /* Ė */, L'E', },
        { 0x0117 /* ė */, L'e', },
        { 0x0118 /* Ę */, L'E', },
        { 0x0119 /* ę */, L'e', },
        { 0x011A /* Ě */, L'E', },
        { 0x011B /* ě */, L'e', },
        { 0x011C /* Ĝ */, L'G', },
        { 0x011D /* ĝ */, L'g', },
        { 0x011E /* Ğ */, L'G', },
        { 0x011F /* ğ */, L'g', },
        { 0x0120 /* Ġ */, L'G', },
        { 0x0121 /* ġ */, L'g', },
        { 0x0122 /* Ģ */, L'G', },
        { 0x0123 /* ģ */, L'g', },
        { 0x0124 /* Ĥ */, L'H', },
        { 0x0125 /* ĥ */, L'h', },
        { 0x0126 /* Ħ */, L'H', },
        { 0x0127 /* ħ */, L'h', },
        { 0x0128 /* Ĩ */, L'I', },
        { 0x0129 /* ĩ */, L'i', },
        { 0x012A /* Ī */, L'I', },
        { 0x012B /* ī */, L'i', },
        { 0x012C /* Ĭ */, L'I', },
        { 0x012D /* ĭ */, L'i', },
        { 0x012E /* Į */, L'I', },
        { 0x012F /* į */, L'i', },
        { 0x0130 /* İ */, L'I', },
        { 0x0131 /* ı */, L'i', },
        { 0x0134 /* Ĵ */, L'J', },
        { 0x0135 /* ĵ */, L'j', },
        { 0x0136 /* Ķ */, L'K', },
        { 0x0137 /* ķ */, L'k', },
        { 0x0138 /* ĸ */, L'k', },
        { 0x0139 /* Ĺ */, L'L', },
        { 0x013A /* ĺ */, L'l', },
        { 0x013B /* Ļ */, L'L', },
        { 0x013C /* ļ */, L'l', },
        { 0x013D /* Ľ */, L'L', },
        { 0x013E /* ľ */, L'l', },
        { 0x013F /* Ŀ */, L'L', },
        { 0x0140 /* ŀ */, L'l', },
        { 0x0141 /* Ł */, L'L', },
        { 0x0142 /* ł */, L'l', },
        { 0x0143 /* Ń */, L'N', },
        { 0x0144 /* ń */, L'n', },
        { 0x0145 /* Ņ */, L'N', },
        { 0x0146 /* ņ */, L'n', },
        { 0x0147 /* Ň */, L'N', },
        { 0x0148 /* ň */, L'n', },
        { 0x0149 /* ŉ */, L'n', },
        { 0x014A /* Ŋ */, L'N', },
        { 0x014B /* ŋ */, L'n', },
        { 0x014C /* Ō */, L'O', },
        { 0x014D /* ō */, L'o', },
        { 0x014E /* Ŏ */, L'O', },
        { 0x014F /* ŏ */, L'o', },
        { 0x0150 /* Ő */, L'O', },
        { 0x0151 /* ő */, L'o', },
        { 0x0154 /* Ŕ */, L'R', },
        { 0x0155 /* ŕ */, L'r', },
        { 0x0156 /* Ŗ */, L'R', },
        { 0x0157 /* ŗ */, L'r', },
        { 0x0158 /* Ř */, L'R', },
        { 0x0159 /* ř */, L'r', },
        { 0x015A /* Ś */, L'S', },
        { 0x015B /* ś */, L's', },
        { 0x015C /* Ŝ */, L'S', },
        { 0x015D /* ŝ */, L's', },
        { 0x015E /* Ş */, L'S', },
        { 0x015F /* ş */, L's', },
        { 0x0160 /* Š */, L'S', },
        { 0x0161 /* š */, L's', },
        { 0x0162 /* Ţ */, L'T', },
        { 0x0163 /* ţ */, L't', },
        { 0x0164 /* Ť */, L'T', },
        { 0x0165 /* ť */, L't', },
        { 0x0166 /* Ŧ */, L'T', },
        { 0x0167 /* ŧ */, L't', },
        { 0x0168 /* Ũ */, L'U', },
        { 0x0169 /* ũ */, L'u', },
        { 0x016A /* Ū */, L'U', },
        { 0x016B /* ū */, L'u', },
        { 0x016C /* Ŭ */, L'U', },
        { 0x016D /* ŭ */, L'u', },
        { 0x016E /* Ů */, L'U', },
        { 0x016F /* ů */, L'u', },
        { 0x0170 /* Ű */, L'U', },
        { 0x0171 /* ű */, L'u', },
        { 0x0172 /* Ų */, L'U', },
        { 0x0173 /* ų */, L'u', },
        { 0x0174 /* Ŵ */, L'W', },
        { 0x0175 /* ŵ */, L'w', },
        { 0x0176 /* Ŷ */, L'Y', },
        { 0x0177 /* ŷ */, L'y', },
        { 0x0178 /* Ÿ */, L'Y', },
        { 0x0179 /* Ź */, L'Z', },
        { 0x017A /* ź */, L'z', },
        { 0x017B /* Ż */, L'Z', },
        { 0x017C /* ż */, L'z', },
        { 0x017D /* Ž */, L'Z', },
        { 0x017E /* ž */, L'z', },
        { 0x017F /* ſ */, L's', },
        { 0x01A0 /* Ơ */, L'O', },
        { 0x01A1 /* ơ */, L'o', },
        { 0x01AF /* Ư */, L'U', },
        { 0x01B0 /* ư */, L'u', },
        { 0x01CD /* Ǎ */, L'A', },
        { 0x01CE /* ǎ */, L'a', },
        { 0x01CF /* Ǐ */, L'I', },
        { 0x01D0 /* ǐ */, L'i', },
        { 0x01D1 /* Ǒ */, L'O', },
        { 0x01D2 /* ǒ */, L'o', },
        { 0x01D3 /* Ǔ */, L'U', },
        { 0x01D4 /* ǔ */, L'u', },
        { 0x01D5 /* Ǖ */, L'U', },
        { 0x01D6 /* ǖ */, L'u', },
        { 0x01D7 /* Ǘ */, L'U', },
        { 0x01D8 /* ǘ */, L'u', },
        { 0x01D9 /* Ǚ */, L'U', },
        { 0x01DA /* ǚ */, L'u', },
        { 0x01DB /* Ǜ */, L'U', },
        { 0x01DC /* ǜ */, L'u', },
        // 02xx
        { 0x0218 /* Ș */, L'S', },
        { 0x0219 /* ș */, L's', },
        { 0x021A /* Ț */, L'T', },
        { 0x021B /* ț */, L't', },
        { 0x0251 /* ɑ */, L'a', },
        // 1Exx
        { 0x1EA0 /* Ạ */, L'A', },
        { 0x1EA1 /* ạ */, L'a', },
        { 0x1EA2 /* Ả */, L'A', },
        { 0x1EA3 /* ả */, L'a', },
        { 0x1EA4 /* Ấ */, L'A', },
        { 0x1EA5 /* ấ */, L'a', },
        { 0x1EA6 /* Ầ */, L'A', },
        { 0x1EA7 /* ầ */, L'a', },
        { 0x1EA8 /* Ẩ */, L'A', },
        { 0x1EA9 /* ẩ */, L'a', },
        { 0x1EAA /* Ẫ */, L'A', },
        { 0x1EAB /* ẫ */, L'a', },
        { 0x1EAC /* Ậ */, L'A', },
        { 0x1EAD /* ậ */, L'a', },
        { 0x1EAE /* Ắ */, L'A', },
        { 0x1EAF /* ắ */, L'a', },
        { 0x1EB0 /* Ằ */, L'A', },
        { 0x1EB1 /* ằ */, L'a', },
        { 0x1EB2 /* Ẳ */, L'A', },
        { 0x1EB3 /* ẳ */, L'a', },
        { 0x1EB4 /* Ẵ */, L'A', },
        { 0x1EB5 /* ẵ */, L'a', },
        { 0x1EB6 /* Ặ */, L'A', },
        { 0x1EB7 /* ặ */, L'a', },
        { 0x1EB8 /* Ẹ */, L'E', },
        { 0x1EB9 /* ẹ */, L'e', },
        { 0x1EBA /* Ẻ */, L'E', },
        { 0x1EBB /* ẻ */, L'e', },
        { 0x1EBC /* Ẽ */, L'E', },
        { 0x1EBD /* ẽ */, L'e', },
        { 0x1EBE /* Ế */, L'E', },
        { 0x1EBF /* ế */, L'e', },
        { 0x1EC0 /* Ề */, L'E', },
        { 0x1EC1 /* ề */, L'e', },
        { 0x1EC2 /* Ể */, L'E', },
        { 0x1EC3 /* ể */, L'e', },
        { 0x1EC4 /* Ễ */, L'E', },
        { 0x1EC5 /* ễ */, L'e', },
        { 0x1EC6 /* Ệ */, L'E', },
        { 0x1EC7 /* ệ */, L'e', },
        { 0x1EC8 /* Ỉ */, L'I', },
        { 0x1EC9 /* ỉ */, L'i', },
        { 0x1ECA /* Ị */, L'I', },
        { 0x1ECB /* ị */, L'i', },
        { 0x1ECC /* Ọ */, L'O', },
        { 0x1ECD /* ọ */, L'o', },
        { 0x1ECE /* Ỏ */, L'O', },
        { 0x1ECF /* ỏ */, L'o', },
        { 0x1ED0 /* Ố */, L'O', },
        { 0x1ED1 /* ố */, L'o', },
        { 0x1ED2 /* Ồ */, L'O', },
        { 0x1ED3 /* ồ */, L'o', },
        { 0x1ED4 /* Ổ */, L'O', },
        { 0x1ED5 /* ổ */, L'o', },
        { 0x1ED6 /* Ỗ */, L'O', },
        { 0x1ED7 /* ỗ */, L'o', },
        { 0x1ED8 /* Ộ */, L'O', },
        { 0x1ED9 /* ộ */, L'o', },
        { 0x1EDA /* Ớ */, L'O', },
        { 0x1EDB /* ớ */, L'o', },
        { 0x1EDC /* Ờ */, L'O', },
        { 0x1EDD /* ờ */, L'o', },
        { 0x1EDE /* Ở */, L'O', },
        { 0x1EDF /* ở */, L'o', },
        { 0x1EE0 /* Ỡ */, L'O', },
        { 0x1EE1 /* ỡ */, L'o', },
        { 0x1EE2 /* Ợ */, L'O', },
        { 0x1EE3 /* ợ */, L'o', },
        { 0x1EE4 /* Ụ */, L'U', },
        { 0x1EE5 /* ụ */, L'u', },
        { 0x1EE6 /* Ủ */, L'U', },
        { 0x1EE7 /* ủ */, L'u', },
        { 0x1EE8 /* Ứ */, L'U', },
        { 0x1EE9 /* ứ */, L'u', },
        { 0x1EEA /* Ừ */, L'U', },
        { 0x1EEB /* ừ */, L'u', },
        { 0x1EEC /* Ử */, L'U', },
        { 0x1EED /* ử */, L'u', },
        { 0x1EEE /* Ữ */, L'U', },
        { 0x1EEF /* ữ */, L'u', },
        { 0x1EF0 /* Ự */, L'U', },
        { 0x1EF1 /* ự */, L'u', },
        { 0x1EF2 /* Ỳ */, L'Y', },
        { 0x1EF3 /* ỳ */, L'y', },
        { 0x1EF4 /* Ỵ */, L'Y', },
        { 0x1EF5 /* ỵ */, L'y', },
        { 0x1EF6 /* Ỷ */, L'Y', },
        { 0x1EF7 /* ỷ */, L'y', },
        { 0x1EF8 /* Ỹ */, L'Y', },
        { 0x1EF9 /* ỹ */, L'y', },
    };

#ifdef DEBUG
    static bool verified_order = false;
    if (!verified_order)
    {
        verified_order = true;
        for (int i = 1; i < sizeof_array(fuzzy_accent_map); i++)
            assert(fuzzy_accent_map[i-1].accent < fuzzy_accent_map[i].accent);
    }
#endif

    int lo = 0;
    int hi = sizeof_array(fuzzy_accent_map);

    while (lo < hi)
    {
        int mid = (lo + hi) / 2;
        int a = fuzzy_accent_map[mid].accent;

        if (c == a)
            return fuzzy_accent_map[mid].normal;
        else if (c < a)
            hi = mid;
        else
            lo = mid + 1;
    }

    return c;
}
